{
  "profile_summary": "Entry-level Software Engineer and AI/ML undergraduate with hands-on experience in Python, Django, and AWS. Skilled in building scalable backend systems, REST APIs, automation pipelines, and cloud-native applications for EdTech and FinTech use cases. Experienced with PostgreSQL, REST API design, authentication workflows, and deploying production systems on AWS.",
  
  "skills": {
    "development": [
      "Python",
      "Django",
      "RESTful APIs",
      "API Integration",
      "Backend Architecture",
      "Automation",
      "Selenium"
    ],
    "cloud_devops": [
      "AWS EC2",
      "AWS RDS",
      "AWS S3",
      "AWS IAM",
      "AWS Elastic Beanstalk",
      "AWS CloudWatch",
      "Docker",
      "Cloud Deployment",
      "Environment Configuration",
      "Scalable Systems"
    ],
    "databases": [
      "PostgreSQL",
      "MongoDB",
      "SQL",
      "Data Modeling",
      "Query Optimization"
    ],
    "ai_ml_analytics": [
      "AI/ML Concepts",
      "Generative AI (Gemini)",
      "Data Analysis",
      "Algorithmic Logic"
    ],
    "tools_practices": [
      "Git",
      "GitHub",
      "Linux",
      "Logging",
      "Error Handling",
      "Unit Testing",
      "CI/CD Basics",
      "Fault Tolerance",
      "Agile Methodologies"
    ]
  },

  "experience": {
    "role": "Software Engineer – Project Experience",
    "type": "Independent & Academic Projects",
    "location": "Bhopal, India",
    "duration": "2022 – Present",
    "projects": [
      {
        "name": "HireIQ – AI-Driven Job Application Automation Platform",
        "technologies": [
          "Python",
          "Django",
          "Selenium",
          "Generative AI (Gemini)",
          "PostgreSQL",
          "AWS RDS",
          "AWS Elastic Beanstalk"
        ],
        "highlights": [
          "Built an end-to-end job automation pipeline for discovery, analysis, and application, reducing manual effort by 70–80%.",
          "Implemented a Python–Django multi-worker architecture for scraping, resume matching, and apply-flow detection with GenAI-based JD scoring.",
          "Designed secure RESTful APIs with authentication, authorization, logging, retries, and fault-tolerant database-driven workflows.",
          "Deployed on AWS with PostgreSQL-backed persistence, enabling scalable, restart-safe processing and operational stability."
        ]
      },
      {
        "name": "IntelliTrade – Automated Trading & Analytics System",
        "technologies": [
          "Python",
          "Django",
          "AI/ML",
          "Data Analysis",
          "Kotak Securities API",
          "Zerodha API",
          "AWS"
        ],
        "highlights": [
          "Developed an AI-powered algorithmic trading platform supporting multi-asset trading including equities and derivatives.",
          "Integrated Kotak Securities API for automated trade execution and Zerodha API for real-time market data ingestion.",
          "Built RESTful backend services in Django to process live data streams, strategy execution, trade logging, and performance monitoring.",
          "Deployed on AWS to support scalable, low-latency operations and secure trade data storage."
        ]
      },
      {
        "name": "NeuroLearn – AI-Based Personalized Learning Platform",
        "technologies": [
          "Generative AI (Gemini)",
          "Django",
          "React Native",
          "AWS",
          "PostgreSQL"
        ],
        "highlights": [
          "Architected an AI-driven learning platform delivering personalized study plans using learner goals, pace, and performance data.",
          "Applied AI/ML to dynamically adapt learning paths, improving learning efficiency, content relevance, and engagement.",
          "Built a scalable Django and PostgreSQL backend deployed on AWS with validation, API security, and database optimization.",
          "Designed RESTful APIs with authentication, authorization, logging, retries, and a React Native app for seamless access."
        ]
      }
    ]
  }
}